In [6]:
# Python SQL toolkit and Object Relational Mapper
import sqlalchemy
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine, inspect, func

In [7]:
# reflect an existing database into a new model
Base = automap_base()

In [8]:
engine = create_engine("sqlite:///../sqlite_db/stock_market_sqlite.db")

In [9]:
# reflect the tables
Base.prepare(engine, reflect=True)

In [10]:
bases = Base.classes.keys()
bases

['GME', 'MSFT', 'TSLA']

In [11]:
# Save references to each table
tesla = Base.classes.TSLA
microsoft = Base.classes.MSFT
gamestop = Base.classes.GME

In [12]:
tesla

sqlalchemy.ext.automap.TSLA

In [13]:
# Create session (link) from Python to the DB
session = Session(engine)

In [14]:
# Inspect column names and types for TSLA table
inspector = inspect(engine)
for base in bases:
    columns = inspector.get_columns(base)
    for column in columns:
        print(column["name"], column["type"])

index BIGINT
Date DATETIME
Open FLOAT
High FLOAT
Low FLOAT
Close FLOAT
Adj Close FLOAT
Volume BIGINT
index BIGINT
Date DATETIME
Open FLOAT
High FLOAT
Low FLOAT
Close FLOAT
Adj Close FLOAT
Volume BIGINT
index BIGINT
Date DATETIME
Open FLOAT
High FLOAT
Low FLOAT
Close FLOAT
Adj Close FLOAT
Volume BIGINT

In [15]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [17]:
# Perform a query to retrieve tesla data
tesla_results = session.query(tesla.Date, tesla.Close).all()
tesla_df = pd.DataFrame(tesla_results, columns=["Date", "Close"])

In [18]:
tesla_df

           Date       Close
0    2015-12-31   48.001999
1    2016-01-04   44.681999
2    2016-01-05   44.686001
3    2016-01-06   43.807999
4    2016-01-07   43.130001
...         ...         ...
1279 2021-02-01  839.809998
1280 2021-02-02  872.789978
1281 2021-02-03  854.690002
1282 2021-02-04  849.989990
1283 2021-02-05  852.229980

[1284 rows x 2 columns]

In [19]:
tesla_df.describe()

             Close
count  1284.000000
mean    116.432522
std     155.598676
min      28.733999
25%      47.733500
50%      62.021999
75%      72.493000
max     883.090027

## Modelling

In [22]:
# Rename features as these names are needed for model fitting
tesla_df = tesla_df.rename(columns={"Date":"ds", "Close":"y"})

In [23]:
tesla_df

             ds           y
0    2015-12-31   48.001999
1    2016-01-04   44.681999
2    2016-01-05   44.686001
3    2016-01-06   43.807999
4    2016-01-07   43.130001
...         ...         ...
1279 2021-02-01  839.809998
1280 2021-02-02  872.789978
1281 2021-02-03  854.690002
1282 2021-02-04  849.989990
1283 2021-02-05  852.229980

[1284 rows x 2 columns]